; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem blocksworld-69)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 - object)
 (:init 
    (arm-empty)
    (clear b16)
    (on b16 b9)
    (on-table b9)
    (clear b2)
    (on b2 b5)
    (on b5 b8)
    (on b8 b10)
    (on b10 b19)
    (on b19 b15)
    (on b15 b17)
    (on b17 b3)
    (on b3 b20)
    (on b20 b1)
    (on b1 b18)
    (on b18 b6)
    (on-table b6)
    (clear b14)
    (on b14 b4)
    (on-table b4)
    (clear b7)
    (on b7 b13)
    (on b13 b11)
    (on b11 b12)
    (on-table b12))
 (:goal (and 
(on-table b7)
(on-table b10)
(on b12 b7)
))
)

; plan
1. (unstack b7 b13)
   deleted: (on b7 b13) (clear b7) (arm-empty)
   added: (holding b7) (clear b13)
   goals met: 0 of 3
2. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 1 of 3
3. (unstack b13 b11)
   deleted: (on b13 b11) (clear b13) (arm-empty)
   added: (holding b13) (clear b11)
   goals met: 1 of 3
4. (putdown b13)
   deleted: (holding b13)
   added: (clear b13) (arm-empty) (on-table b13)
   goals met: 1 of 3
5. (unstack b11 b12)
   deleted: (on b11 b12) (clear b11) (arm-empty)
   added: (holding b11) (clear b12)
   goals met: 1 of 3
6. (putdown b11)
   deleted: (holding b11)
   added: (clear b11) (arm-empty) (on-table b11)
   goals met: 1 of 3
7. (pickup b12)
   deleted: (clear b12) (on-table b12) (arm-empty)
   added: (holding b12)
   goals met: 1 of 3
8. (stack b12 b7)
   deleted: (clear b7) (holding b12)
   added: (arm-empty) (clear b12) (on b12 b7)
   goals met: 2 of 3
9. (unstack b2 b5)
   deleted: (on b2 b5) (clear b2) (arm-empty)
   added: (holding b2) (clear b5)
   goals met: 2 of 3
10. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 2 of 3
11. (unstack b5 b8)
   deleted: (on b5 b8) (clear b5) (arm-empty)
   added: (holding b5) (clear b8)
   goals met: 2 of 3
12. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 2 of 3
13. (unstack b8 b10)
   deleted: (on b8 b10) (clear b8) (arm-empty)
   added: (holding b8) (clear b10)
   goals met: 2 of 3
14. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 2 of 3
15. (unstack b10 b19)
   deleted: (on b10 b19) (clear b10) (arm-empty)
   added: (holding b10) (clear b19)
   goals met: 2 of 3
16. (putdown b10)
   deleted: (holding b10)
   added: (clear b10) (arm-empty) (on-table b10)
   goals met: 3 of 3
